import { useState, useRef } from "react";
import bannerImg from "./assets/สีอีพ็อกซี่.png";
import s300Img from "./assets/80184.jpg";
import s200Img from "./assets/e0fd6f1b-ac6a-4401-891c-98d63a52532a.png";
import { Swiper, SwiperSlide } from "swiper/react";
import { Navigation, Pagination, Autoplay } from "swiper/modules";
import img1 from "./assets/LINE_ALBUM_อบรมดับเพลิง 2568_260522_3.jpg";
import img2 from "./assets/Screenshot 2026-06-10 084513.png";
import img3 from "./assets/steel.png";
import img4 from "./assets/special.png";

import "swiper/css";
import "swiper/css/navigation";
import "swiper/css/pagination";
const ralColors = [
  ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
];
/* ================= DATA ================= */
const categories = [
  {
    id: 1,

    name: "สีพื้นอุตสาหกรรม",

    items: [
      {
        title: "EPOXY SELF-LEVELING สีทับหน้าอีพ็อกซี่ปรับระดับได้เอง",
        colorChart: [
   ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
  ],

        products: [
         

          {
            code: "RTP-S300",
          images: [ img1, img2,img3, img4,],
            name: "สีอีพ็อกซี่ปรับระดับด้วยตัวเอง อัตราส่วน 3 ต่อ 1",

            description:
              "RTP-S300 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการความเงา เรียบ และไร้รอยต่อ",

            usage: [
              "พื้นโรงงาน",
              "ห้องปฏิบัติการ",
              "โชว์รูมรถ",
              "หอประชุม",
              "ลานจอดรถ",
              "พิพิธภัณฑ์",
              "โรงแรม",
            ],

            coverage: "1.28 กก./ตร.ม. @ 1 มม.",

            package: [
              "24 กก./ชุด (ส่วน A = 18 กก / ส่วน B = 6 กก)",
              "4 กก./ชุด (ส่วน A = 3 กก / ส่วน B = 1 กก)",
            ],
          },

          {
            code: "RTP-S400",

            name: "สีอีพ็อกซี่ปรับระดับด้วยตัวเอง อัตราส่วน 4 ต่อ 1",

            description:
              "RTP-S400 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการความเงา เรียบ และไร้รอยต่อ",

            usage: [
              "พื้นโรงงาน",
              "ห้องปฏิบัติการ",
              "โชว์รูมรถ",
              "หอประชุม",
              "ลานจอดรถ",
              "พิพิธภัณฑ์",
              "โรงแรม",
            ],

            coverage: "1.28 กก./ตร.ม. @ 1 มม.",

            package: [
              "25 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 5 กก)",
              "4 กก./ชุด (ส่วน A = 3.2 กก / ส่วน B = 0.8 กก)",
            ],
          },
  {
            code: "RTP-S501",

            name: "สีอีพ็อกซี่พุตตี้",
 

            description:
              "RTP-S501 เป็นสีชั้นกลางอีพ็อกซี่ 2 ส่วน สามารถผสมกับฟูมซิลิกา เพื่อปกปิดรูพรุนของพื้น",

            usage: [
              "ปกปิดรูพรุนของพื้น",
              "ป้องกันฟองอากาศก่อนลงสีทับหน้า",
            ],

            coverage: "ขึ้นอยู่กับการใช้งาน",

            package: [
              "27 กก./ชุด (ส่วน A = 22.5 กก / ส่วน B = 4.5 กก)",
            ],
          },
          {
            code: "RTP-S330",

            name: "สีอีพ็อกซี่ปรับระดับด้วยตัวเอง ชนิดทนสารเคมีสูง",
 
            description:
              "RTP-S330 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการทนทานต่อสารเคมีได้สูง",

            usage: [
              "พื้นโรงงาน",
              "ห้องปฏิบัติการเคมี",
              "โกดัง",
            ],

            coverage: "1.28 กก./ตร.ม. @ 1 มม.",

            package: [
              "24 กก./ชุด (ส่วน A = 18 กก / ส่วน B = 6 กก)",
              "4 กก./ชุด (ส่วน A = 3 กก / ส่วน B = 1 กก)",
            ],
          },
 {
            code: "RTP-S201",
           images: [ img1, img2,img3, img4,],
            name: "สีอีพ็อกซี่ปรับระดับด้วยตัวเอง ชนิดใส",
  
            description:
              "RTP-S201 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการใส เรียบ และไร้รอยต่อ",

              
            usage: [
              "พิพิธภัณฑ์",
              "โรงแรม",
            ],

            coverage: "1.1 กก./ตร.ม. @ 1 มม.",

            package: [
              "30 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 10 กก)",
              "6 กก./ชุด (ส่วน A = 4 กก / ส่วน B = 2 กก)",
            ],
          },
          {
            code: "RTP-S440",

            name: "สีอีพ็อกซี่ปรับระดับด้วยตัวเอง ชนิดถ่ายเทประจุไฟฟ้า",
 

            description:
              "RTP-S440 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการถ่ายเทประจุไฟฟ้า เพื่อป้องกันการเกิดไฟฟ้าสถิต",

            usage: [
              "โรงงานอิเล็กทรอนิกส์",
              "พื้นที่ป้องกันไฟฟ้าสถิต",
            ],

            coverage: "1.28 กก./ตร.ม. @ 1 มม.",

            package: [
              "25 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 5 กก)",
              "4 กก./ชุด (ส่วน A = 3.2 กก / ส่วน B = 0.8 กก)",
            ],
          },
        ],
      },

     {
  title: "EPOXY COATING  สีเคลือบผิวอีพ็อกซี่",
colorChart: [
   ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
  ],
  products: [
    {
      code: "RTP-R300",

      name: "สีเคลือบผิวอีพ็อกซี่ อัตราส่วน 3 ต่อ 1",
      description:
        "RTP-R300 เป็นสีทับหน้าอีพ็อกซี่ฟิล์มบาง 2 ส่วน ชนิดไม่มีตัวทำละลาย ใช้สำหรับงานพื้นคอนกรีตที่ใช้งานหนัก มีการยึดเกาะได้ดี และทนทานต่อสารเคมี",

      usage: [
        "โรงงาน",
        "โกดัง",
        "โรงเรียน",
      ],

      coverage: "0.43 – 0.72 กก./ตร.ม @300 – 500 ไมครอน",

      package: [
        "24 กก./ชุด (ส่วน A = 18 กก. / ส่วน B = 6 กก.)",
        "4 กก./ชุด (ส่วน A = 3 กก. / ส่วน B = 1 กก.)",
      ],
    },

    {
      code: "RTP-R400",

      name: "สีเคลือบผิวอีพ็อกซี่ อัตราส่วน 4 ต่อ 1",
 
      description:
        "RTP-R400 เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ไม่มีส่วนผสมของตัวทำละลาย สามารถปรับระดับด้วยตัวเอง ใช้ในงานระบบพื้นอีพ็อกซี่ที่ต้องการใส เรียบ และไร้รอยต่อ",

      usage: [
        "โรงงาน",
        "โกดัง",
        "โรงเรียน",
      ],

      coverage: "0.1 – 0.14 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "30 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 10 กก)",
        "6 กก./ชุด (ส่วน A = 4 กก / ส่วน B = 2 กก)",
      ],
    },

    {
      code: "RTP-R402",

      name: "สีเคลือบผิวอีพ็อกซี่ ชนิดทนสารเคมีสูง",
 
     

      description:
        "RTP-R402 เป็นสีทับหน้าอีพ็อกซี่ฟิล์มบาง 2 ส่วน ชนิดไม่มีตัวทำละลาย ใช้สำหรับงานพื้นคอนกรีตที่ต้องการความทนทานต่อสารเคมีได้สูง",

      usage: [
        "ห้องแลป",
        "โกดังสารเคมี",
      ],

      coverage: "0.375 กก./ตร.ม @250 ไมครอน",

      package: [
        "24 กก./ชุด (ส่วน A = 18 กก / ส่วน B = 6 กก)",
      ],
    },
  ],
},

    {
  title: "POLYURETHANE COATING  สีเคลือบผิวโพลียูรีเทน",
colorChart: [
   ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
  ],
  products: [
    {
      code: "RTP-R500",

      name: "สีโพลียูรีเทน ชนิดความเงาสูง สำหรับงานภายนอก",


      description:
        "RTP-R500 เป็นสีทับหน้าโพลียูรีเทน 2 ส่วน มีตัวทำละลาย ชนิดความเงาสูง ใช้สำหรับงานพื้นคอนกรีตที่ต้องการพื้นที่เงา สามารถใช้งานภายนอกได้ มีการยึดเกาะได้ดี และทนทานต่อสารเคมี",

      usage: [
        "โรงงาน",
        "พิพิธภัณฑ์",
        "โรงแรม",
      ],

      coverage: "0.11 – 0.17 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "20 กก./ชุด (ส่วน A = 16 กก / ส่วน B = 4 กก)",
        "4 กก./ชุด (ส่วน A = 3.2 กก / ส่วน B = 0.8 กก)",
      ],
    },

    {
      code: "RTP-R501",

      name: "สีโพลียูรีเทน ชนิดด้าน สำหรับงานภายนอก",


      description:
        "RTP-R501 เป็นสีทับหน้าโพลียูรีเทน 2 ส่วน มีตัวทำละลาย ชนิดด้าน ใช้สำหรับงานพื้นคอนกรีตที่ต้องการพื้นที่ด้าน สามารถใช้งานภายนอกได้ มีการยึดเกาะได้ดี และทนทานต่อสารเคมี",

      usage: [
        "โรงงาน",
        "พิพิธภัณฑ์",
        "โรงแรม",
      ],

      coverage: "0.11 – 0.17 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "20 กก./ชุด (ส่วน A = 16 กก / ส่วน B = 4 กก)",
        "4 กก./ชุด (ส่วน A = 3.2 กก / ส่วน B = 0.8 กก)",
      ],
    },

    {
      code: "RTP-R502",

      name: "สีโพลียูรีเทน สำหรับงานภายใน",

  

      description:
        "RTP-R502 เป็นสีทับหน้าโพลียูรีเทน 2 ส่วน มีตัวทำละลาย ใช้สำหรับงานพื้นคอนกรีตที่ต้องการพื้นที่เงา สามารถใช้งานภายใน มีการยึดเกาะได้ดี และทนทานต่อสารเคมี",

      usage: [
        "โรงงาน",
        "พิพิธภัณฑ์",
        "โรงแรม",
      ],

      coverage: "0.11 – 0.17 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "20 กก./ชุด (ส่วน A = 16 กก / ส่วน B = 4 กก)",
        "4 กก./ชุด (ส่วน A = 3.2 กก / ส่วน B = 0.8 กก)",
      ],
    },
  ],
},

      {
  title: "POLYURETHANE SCREED สีพียูสกรีต",
   colorChart: [
   ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
  ],
showPUS: true,
  products: [
    {
      code: "RTP- PU01",

      name: "รองพื้นโพลียูรีเทนคอนกรีต  ",


      description:
        "RTP-PU01 เป็นรองพื้นโพลียูรีเทนคอนกรีต 3 ส่วน ใช้สําหรับเป็นชั่นรองพื้น ในระบบพื้นโพลียูรีเทนคอนกรีต สามารถยึดเกาะกับคอนกรีตและทับหน้าได้ดี  ",

      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "18 กก./ชุด (ส่วน A = 3 กก., ส่วน B = 3 กก., ส่วน C = 12 กก.)",
      ],
    },

    {
      code: "RTP- PUHF68",

      name: "โพลียูรีเทนคอนกรีต 6-8 มม. ชนิดด้าน",


      description:
        "RTP-PUHF68 เป็นระบบโพลียูรีเทน 4 ส่วน ปรับระดับได้เอง ชนิดผิวด้าน กันลื่น ความหนา 6-8 มม. เหมาะสําหรับพื้นคอนกรีตห้องเย็นในโรงงานอุตสาหกรรม เพื่อรองรับการใช้งานที่หนัก และทนทานต่อการเปลี่ยนแปลงของอุณหภูมิได้ดี ",

      usage: [
         "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "15 กก./ชุด (ส่วน A = 1.5 กก., ส่วน B = 1.5 กก., ส่วน C = 7 กก., ส่วน D = 5 ส่วน) ",
      ],
    },

    {
      code: "RTP- PUHF68(G)",

      name: "โพลียูรีเทนคอนกรีต 6-8 มม. ชนิดเงา ",

  

      description:
        "RTP-R502 RTP-PUHF68(G) เป็นระบบโพลียูรีเทน 4 ส่วน ปรับระดับได้เอง ชนิดผิวเงา กันลื่น ความหนา 6-8 มม. เหมาะสําหรับพื้นคอนกรีตห้องเย็นในโรงงานอุตสาหกรรม เพื่อรองรับการใช้งานที่หนัก และทนทานต่อการเปลี่ยนแปลงของอุณหภูมิได้ดี  ",

      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "15 กก./ชุด (ส่วน A = 1.5 กก., ส่วน B = 1.5 กก., ส่วน C = 7 กก., ส่วน D = 5 ส่วน)",
        
      ],
    },
    
    {
      code: "RTP-PULF12(G)",

      name: "โพลียูรีเทนคอนกรีต 1-2 มม. ชนิดเงา ",

  

      description:
        "RTP-PULF12(G) เป็นระบบโพลียูรีเทนคอนกรีต 3 ส่วน ปรับระดับได้เอง ชนิดผิวเรียบ เงา สามารถติดตั้งที่ความหนา 1-2 มม. เหมาะสําหรับงานพื้นคอนกรีตทั่วไป เพื่อเพิ่มความทนทานและสวยงาม  ",

      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "14 กก./ชุด (ส่วน A = 3 กก., ส่วน B = 3 กก., ส่วน C = 8 กก.) ",
      ],
    },
    {
      code: "RTP- PULF12",

      name: "โพลียูรีเทนคอนกรีต 1-2 มม. ชนิดด้าน ",

  

      description:
        "RTP-PULF12(G) เป็นระบบโพลียูรีเทนคอนกรีต 3 ส่วน ปรับระดับได้เอง ชนิดผิวเรียบ ด้าน สามารถติดตั้งที่ความหนา 1-2 มม. เหมาะสําหรับงานพื้นคอนกรีตทั่วไป เพื่อเพิ่มความทนทานและสวยงาม  ",

      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "14 กก./ชุด (ส่วน A = 3 กก., ส่วน B = 3 กก., ส่วน C = 8 กก.) ",
      ],
    },
    {
      code: "RTP-PUMF35(G) ",

      name: "โพลียูรีเทนคอนกรีต 3-5 มม. ชนิดเงา  ",

      description:
        "RTP-PUMF35(G) เป็นระบบโพลียูรีเทนคอนกรีต 3 ส่วน ปรับระดับได้เอง ชนิดผิวเรียบ เงา สามารถติดตั้งที่ความหนา 3-5มม. เหมาะสําหรับพื้นคอนกรีตในโรงงานอุตสาหกรรม เพื่อรองรับการใช้งานที่หนักและทนทานต่อการเปลี่ยนแปลงของอุณหภูมิ นอกจากนี้สามารถนําไปใช้ในงานพื้นคอนกรีตทั่วไป เพื่อเพิ่มความทนทานและสวยงาม  ",
      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "18 กก./ชุด (ส่วน A = 3 กก., ส่วน B = 3 กก., ส่วน C = 12 กก.) ",
      ],
    },
     {
      code: "RTP-PUMF35",

      name: "โพลียูรีเทนคอนกรีต 3-5 มม. ชนิดด้าน ",

      description:
        "RTP-PUMF35 เป็นระบบโพลียูรีเทนคอนกรีต 3 ส่วน ปรับระดับได้เอง ชนิดผิวเรียบด้าน สามารถติดตั้งที่ความหนา 3-5 มม. ได้ เหมาะสําหรับพื้นคอนกรีตในโรงงานอุตสาหกรรม เพื่อรองรับการใช้งานที่หนักและทนทานต่อการเปลี่ยนแปลงของอุณหภูมิ นอกจากนี้สามารถนําไปใช้ในงานพื้นคอนกรีตทั่วไป เพื่อเพิ่มความทนทานและสวยงามได้ ",   
      usage: [
        "โรงงาน",
        "คลังสินค้า",
        "โรงแรม",
      ],

      coverage: "ขึ้นอยู่กับการใช้งาน",

      package: [
        "18 กก./ชุด (ส่วน A = 3 กก., ส่วน B = 3 กก., ส่วน C = 12 กก.)  ",
      ],
    },
  ],
},
     {
  title: " Anti-static Epoxy สีป้องกันไฟฟ้าสถิต",
 colorChart: [
   ["RAL 1001", "Beige", "#D2B48C"],
  ["RAL 1013", "Oyster White", "#EAE6CA"],
  ["RAL 1014", "Ivory", "#DDC49A"],
  ["RAL 1015", "Light Ivory", "#E6D2B5"],

  ["RAL 1028", "Melon Yellow", "#FF9E00"],
  ["RAL 1032", "Broom Yellow", "#D6A200"],
  ["RAL 1034", "Pastel Yellow", "#F4A900"],

  ["RAL 2000", "Yellow Orange", "#DD7907"],
  ["RAL 2004", "Pure Orange", "#E25303"],
  ["RAL 2008", "Bright Red Orange", "#FF5E00"],

  ["RAL 3000", "Flame Red", "#AF2B1E"],
  ["RAL 3002", "Carmine Red", "#A52019"],
  ["RAL 3003", "Ruby Red", "#8A1C1C"],
  ["RAL 3015", "Light Pink", "#D8A0A6"],
  ["RAL 3017", "Rose", "#E63244"],
  ["RAL 3020", "Traffic Red", "#CC0605"],

  ["RAL 5005", "Signal Blue", "#154889"],
  ["RAL 5007", "Brilliant Blue", "#41678D"],
  ["RAL 5010", "Gentian Blue", "#0E294B"],
  ["RAL 5012", "Light Blue", "#2973B8"],
  ["RAL 5015", "Sky Blue", "#007CB0"],
  ["RAL 5017", "Traffic Blue", "#005B8C"],

  ["RAL 6001", "Emerald Green", "#287233"],
  ["RAL 6002", "Leaf Green", "#276235"],
  ["RAL 6010", "Grass Green", "#4C9141"],
  ["RAL 6018", "Yellow Green", "#57A639"],
  ["RAL 6019", "Pastel Green", "#BDECB6"],
  ["RAL 6024", "Traffic Green", "#308446"],
  ["RAL 6026", "Opal Green", "#015D52"],
  ["RAL 6029", "Mint Green", "#006F3C"],
  ["RAL 6032", "Signal Green", "#1B8F4E"],
  ["RAL 6037", "Pure Green", "#00A933"],

  ["RAL 7001", "Silver Grey", "#8F999F"],
  ["RAL 7035", "Light Grey", "#D7D7D7"],
  ["RAL 7038", "Agate Grey", "#B5B8B1"],
  ["RAL 7040", "Window Grey", "#9DA3A6"],
  ["RAL 7042", "Traffic Grey A", "#8D948D"],
  ["RAL 7045", "Telegrey 1", "#91969A"],
  ["RAL 7047", "Telegrey 4", "#CFD0CF"],

  ["RAL 9003", "Signal White", "#F4F4F4"],
  ["RAL 9010", "Pure White", "#FDF4E3"],
  ["RAL 9012", "Cleanroom", "#F5F5F5"],
  ["RAL 9017", "Traffic Black", "#1E1E1E"],
  ["RAL 9018", "Papyrus White", "#D7D7D0"],
  ],
  showESD: true,
  products: [
    {
      code: "RTP-R341",

      name: "สีเคลือบผิวอีพ็อกซี่ 2 ส่วน ชนิดป้องกันไฟฟ้าสถิต",

      description:
        "RTP-R341 เป็นสีเคลือบผิวอีพ็อกซี่ 2 ส่วน ชนิดป้องกันไฟฟ้าสถิต มีตัวทําละลายมีค่าความต้านทานไฟฟ้าอยู่ในช่วง 105-109โอห์มมีสมบัติการถ่ายเทประจุไฟฟ้าได้ฟิล์มบางผิวเรียบความเงาสูงไร้รอยต่อมีการยึดเกาะดีและทนทานต่อสารเคมีทั่วไปได้ ",
      usage: [
        "รองพื้นคอนกรีต",
        "ปรับระดับพื้นผิวคอนกรีต",
      ],

      coverage:[ "ขึ้นกับการใช้งาน",  ],

      package: [
        "4 กก./ชุด (ส่วน A = 3.2 กก., ส่วน B = 8 กก.)",
        "20 กก./ชุด (ส่วน A = 16 กก., ส่วน B = 4 กก.) ",
      ],
    },

    {
      code: "RTP-S340 ",
      name: "สีทับหน้าอีพ็อกซี่ปรับระดับได้เอง ชนิดป้องกันไฟฟ้าสถิต",
      description:
        "RTP-S340   เป็นสีทับหน้าอีพ็อกซี่ 2 ส่วน ชนิดป้องกันไฟฟ้ าสถิต สามารถปรับระดับได้ด้วยตัวเอง ใช้งานง่าย ไม่มีกลิ่นฉุนมีค่าความต้านทานไฟฟ้าอยู่ในช่วง 106-109โอห์มมีสมบัติการถ่ายเทประจุไฟฟ้าได้นอกจากนี้ยังมีสมบัติเชิงกลดี มีความเงาสูง ผิวเรียบ และไร้รอยต่อ  ",
      usage: [
        "รองพื้นคอนกรีต",
        "ปรับระดับพื้นผิวคอนกรีต",
      ],
      coverage:[ "ขึ้นกับการใช้งาน",  ],
      package: [
        "4 กก./ชุด (ส่วน A = 3.2 กก., ส่วน B = 0.8 กก.)",
        "20 กก./ชุด (ส่วน A = 16 กก., ส่วน B = 4 กก.) ",
      ],
    },
        {
      code: "RTP-PUMF(GE) ",
      name: "สีทับหน้าโพลียูรีเทนคอนกรีต 3 ส่วน",
      description:
        "RTP– PUESD เป็นสีทับหน้าโพลียูรีเทนคอนกรีต 3 ส่วน ชนิดป้องกันไฟฟ้าสถิตซึ่งมีความค่าความต้านทานไฟฟ้า 106– 109 Ω มีสมบัติการถ่ายเทประจุไฟฟ้าได้ดีนอกจากนี้ยังมีสมบัติเชิงกลและการยึดเกาะที่ดี ",
      usage: [
        "รองพื้นคอนกรีต",
        "ปรับระดับพื้นผิวคอนกรีต",
      ],
      coverage:[ "ขึ้นกับการใช้งาน",  ],
      package: [
        "13 กก./ชุด (ส่วน A = 3 กก. , ส่วน B = 3 กก., ส่วน C = 7 กก)",
      ],
    },
        {
      code: "RTP-S341",
      name: "สีทับหน้าอีพ็อกซี่ปรับระดับ 2 ส่วน",
      description:
        "RTP-S341 เป็นสีทับหน้าอีพ็อกซี่ปรับระดับ 2 ส่วน ชนิดนำไฟฟ้าได้ ซึ่งมีค่านำไฟฟ้าอยู่ในช่วง 104– 106 Ω มีสมบัติการถ่ายเทประจุไฟฟ้าได้ดี นอกจากนี้ยังมีเชิงกลและการยึดเกาะที่ดี ",
      usage: [
        "รองพื้นคอนกรีต",
        "ปรับระดับพื้นผิวคอนกรีต",
      ],
      coverage:[ "ขึ้นกับการใช้งาน",  ],
      package: [
        "20 กก./ชุด (ส่วน A = 16 กก. , ส่วน B = 4 กก.)"
      ],
    },
  ],
},
     {
  title: "สีเคลือบผิวอะครีลิค",
  products: [
    {
      code: "RTP-R100",

      name: "สีอะครีลิค ชนิดกึ่งเงา",

      description:
        "RTP-R100 เป็นสีทับหน้าอะครีลิค ชนิดกึ่งเงา เหมาะสำหรับงานพื้นคอนกรีตและฟลอร์ฮาร์ดเดนเนอร์ที่มีความชื้นไม่เกิน 20%",

      usage: [
        "พื้นคอนกรีต",
        "พื้นฟลอร์ฮาร์ดเดนเนอร์",
        "พื้นโรงงาน",
      ],

      coverage: "0.1 – 0.16 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "18 กก.",
      ],
    },

    {
      code: "RTP-R101",

      name: "สีอะครีลิค ชนิดเงา",

      description:
        "RTP-R101 เป็นสีทับหน้าอะครีลิค ชนิดเงา เหมาะสำหรับงานพื้นคอนกรีตและฟลอร์ฮาร์ดเดนเนอร์ที่มีความชื้นไม่เกิน 20%",

      usage: [
        "พื้นคอนกรีต",
        "พื้นฟลอร์ฮาร์ดเดนเนอร์",
        "พื้นโรงงาน",
      ],

      coverage: "0.1 – 0.16 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "18 กก.",
      ],
    },
  ],
},

      {
  title: "รองพื้นอีพ็อกซี่",

  products: [
    {
      code: "RTP-P100",

      name: "รองพื้นอีพ็อกซี่ 2 ส่วน",

      description:
        "RTP-P100 เป็นรองพื้นอีพ็อกซี่ 2 ส่วน ชนิดมีตัวทำละลาย ใช้สำหรับรองพื้นคอนกรีต เพื่อปิดรูพรุนและเพิ่มการยึดเกาะระหว่างคอนกรีตกับสีทับหน้า",

      usage: [
        "พื้นคอนกรีต",
        "พื้นฟลอร์ฮาร์ดเดนเนอร์",
        "พื้นโรงงาน",
      ],

      coverage: "0.1 – 0.16 กก./ตร.ม @50 – 75 ไมครอน",

      package: [
        "18 กก.",
      ],
    },

    {
      code: "RTP-P700",

      name: "รองพื้นอีพ็อกซี่ 2 ส่วน สำหรับป้องกันไฟฟ้าสถิต",
  

      description:
        "RTP-P700 เป็นรองพื้นอีพ็อกซี่ 2 ส่วน ชนิดมีตัวทำละลาย ใช้สำหรับรองพื้นคอนกรีต เพื่อปิดรูพรุน เพิ่มความสามารถในการถ่ายเทประจุไฟฟ้า และเพิ่มการยึดเกาะระหว่างคอนกรีตกับสีทับหน้า",

      usage: [
        "รองพื้นคอนกรีต",
        "พื้นป้องกันไฟฟ้าสถิต",
      ],

      coverage: "0.10 – 0.20 กก./ตร.ม. @50 – 100 ไมครอน",

      package: [
        "18 กก./ชุด (ส่วน A = 15 กก / ส่วน B = 3 กก)",
        "3.6 กก./ชุด (ส่วน A = 3 กก / ส่วน B = 0.6 กก)",
      ],
    },
  ],
},

     {
  title: "มอต้าร์",

  products: [
    {
      code: "RTP-M101",

      name: "มอร์ต้า",



      description:
        "RTP-M101 เป็นมอร์ต้าอีพ็อกซี่ 2 ส่วน สามารถผสมกับทรายได้ ใช้เป็นชั้นกลางสำหรับปรับระดับพื้นผิวคอนกรีตให้สม่ำเสมอ",

      usage: [
        "รองพื้นคอนกรีต",
        "ปรับระดับพื้นผิวคอนกรีต",
      ],

      coverage: "ขึ้นกับการใช้งาน",

      package: [
        "30 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 10 กก)",
        "15 กก./ชุด (ส่วน A = 10 กก / ส่วน B = 5 กก)",
        "6 กก./ชุด (ส่วน A = 4 กก / ส่วน B = 2 กก)",
      ],
    },
  ],
},

      {
  title: "บล็อกความชื้น",

  products: [
    {
      code: "RTP-C100",

      name: "ซีเมนต์สำหรับป้องกันความชื้น",

  

      description:
        "RTP-C100 เป็นระบบอีพ็อกซี่ 3 ส่วน ผสมซีเมนต์ เหมาะสำหรับใช้เป็นสีชั้นกลาง เพื่อป้องกันความชื้นจากใต้พื้นคอนกรีต และมีความทนทานต่อสภาพกรดและด่างได้ดี",

      usage: [
        "พื้นที่มีความชื้น",
        "ชั้นกลางระบบพื้นอีพ็อกซี่",
        "พื้นคอนกรีต",
      ],

      coverage: "3.0 กก./ตร.ม. @ 2 มม., น้ำ 5 – 6 ลิตร",

      package: [
        "24.5 กก./ชุด (ส่วน A = 3 กก / ส่วน B = 3 กก / ส่วน C = 20 กก)",
      ],
    },
  ],
},
    ],
  },

  {
    id: 2,
    name: "สีโครงสร้างเหล็ก",

    items: [
     {
  title: "สีรองพื้นกันสนิม",
  products: [
    {
      code: "RTP-P500",

      name: "สีรองพื้นกันสนิมอีพ็อกซี่ ด้วยผงซิงค์ฟอตเฟต",
    

      description:
        "RTP-P500 เป็นสีรองพื้นกันสนิมอีพ็อกซี่ 2 ส่วน ที่มีผงสีซิงค์ฟอตเฟตและอลูมิเนียม ใช้สำหรับงานเหล็ก เพื่อป้องกันการเกิดสนิม",

      usage: [
        "งานเหล็ก",
        "ป้องกันสนิม",
        "โครงสร้างเหล็ก",
      ],

      coverage: "0.09 – 0.13 กก./ตร.ม. @50 -75 ไมครอน",

      package: [
        "24 กก./ชุด (ส่วน A = 20 กก / ส่วน B = 4 กก)",
        "4.8 กก./ชุด (ส่วน A = 4 กก / ส่วน B = 0.8 กก)",
      ],
    },

    {
      code: "RTP-P600",

      name: "สีรองพื้นแดงกันสนิม ด้วยผงอ๊อกไซด์",

   

      description:
        "RTP-P600 เป็นสีรองพื้นกันสนิมอัลขิดเรซิ่น ที่มีผงสีอ๊อกไซด์ ใช้สำหรับงานเหล็ก เพื่อป้องกันการเกิดสนิม",

      usage: [
        "งานเหล็ก",
        "ป้องกันสนิม",
        "โครงสร้างเหล็ก",
      ],

      coverage: "0.06 – 0.10 กก./ตร.ม. @30 -50 ไมครอน",

      package: [
        "24 กก.",
        "4.5 กก.",
      ],
    },

    {
      code: "RTP-P999",

      name: "สีรองพื้นกันสนิมอีพ็อกซี่ ด้วยผงอลูมิเนียม",

     

      description:
        "RTP-P999 เป็นสีรองพื้นกันสนิมอีพ็อกซี่ 2 ส่วน ที่มีซิงค์ฟอตเฟตและอลูมิเนียม ใช้เพื่อป้องกันการเกิดสนิม",

      usage: [
        "งานเหล็ก",
        "ป้องกันสนิม",
        "โครงสร้างเหล็ก",
      ],

      coverage: "0.09 – 0.14 กก./ตร.ม. @50 -75 ไมครอน",

      package: [
        "27.5 กก./ชุด (ส่วน A = 25 กก / ส่วน B = 2.5 กก)",
        "5.5 กก./ชุด (ส่วน A = 5 กก / ส่วน B = 0.5 กก)",
      ],
    },
  ],
},

     {
  title: "สีอัลคิด",

  products: [
    {
      code: "RTP-E100",

      name: "สีเคลือบผิวแห้งช้า",



      description:
        "RTP-E100 เป็นสีทับหน้าสำหรับงานเหล็ก ผลิตจากอัลคิดเรซิ่นที่มีส่วนผสมของผงสี มีสมบัติการแห้งตัวเร็ว ทนทานต่อสภาวะอากาศได้ดี ใช้งานง่าย และปราศจากสารปรอทและตะกั่ว จึงปลอดภัยต่อผู้ใช้งาน",

      usage: [
        "งานทาเหล็ก",
        "โครงสร้างเหล็ก",
      ],

      coverage: "0.06 – 0.1 กก./ตร.ม. @30 – 50 ไมครอน",

      package: [
        "18.9 กก.",
        "3.785 กก.",
      ],
    },

    {
      code: "RTP-E120",

      name: "สีเคลือบลายฆ้อน",


      description:
        "RTP-E120 เป็นสีทับหน้าสำหรับงานเหล็ก ผลิตจากอัลคิดเรซิ่นที่มีส่วนผสมของอลูมิเนียม ใช้สำหรับพ่นหรือทาเพื่อให้เกิดลวดลายสวยงาม ทนทานต่อสภาวะแวดล้อม ใช้งานง่าย และปราศจากสารปรอทและตะกั่ว",

      usage: [
        "เครื่องใช้สำนักงาน",
        "เครื่องจักรอุตสาหกรรม",
        "งานพ่นเหล็ก",
      ],

      coverage: "0.06 – 0.1 กก./ตร.ม. @30 – 50 ไมครอน",

      package: [
        "24 กก.",
        "4.5 กก.",
      ],
    },
  ],
},
    ],
  },

  {
    id: 3,
    name: "สีน้ำทาอาคาร",

    items: [
      {
  title: "รองพื้นสีน้ำ",

  products: [
    {
      code: "RTP-P102",

      name: "สีรองพื้นปูนใหม่กันด่าง",

      description:
        "RTP-P102 เป็นสีรองพื้นที่ผลิตจากอะครีลิคเรซิ่น 100% สามารถทนต่อความเป็นด่างของปูนฉาบหรือคอนกรีตได้ดี ช่วยป้องกันรอยด่างและคราบเกลือ พร้อมเพิ่มการยึดเกาะระหว่างชั้นปูนกับสีทับหน้า",

      usage: [
        "รองพื้นปูนใหม่",
        "พื้นผิวคอนกรีต",
        "ป้องกันด่าง",
      ],

      coverage: "0.10 – 0.12 กก./ตร.ม. @35 -40 ไมครอน",

      package: [
        "18.9 ลิตร",
      ],
    },

    {
      code: "RTP-P105",

      name: "สีรองพื้นอเนกประสงค์",

      description:
        "RTP-P105 เป็นสีรองพื้นที่ช่วยเพิ่มการยึดเกาะของสีทับหน้า เหมาะสำหรับใช้งานกับพื้นผิวปูนและคอนกรีต ใช้งานง่าย และช่วยให้สีทับหน้าติดทนนาน",

      usage: [
        "รองพื้นผนังปูน",
        "พื้นผิวคอนกรีต",
        "งานทาสีอาคาร",
      ],

      coverage: "0.06 – 0.1 กก./ตร.ม. @30 – 50 ไมครอน",

      package: [
        "17 กก.",
      ],
    },
  ],
},

    {
  title: "สีน้ำอะครีลิค",

  products: [
    {
      code: "RTP-E240",

      name: "สีน้ำอะครีลิค สำหรับภายในและภายนอก",

      description:
        "RTP-E240 เป็นสีน้ำอะครีลิค ผลิตจากอะครีลิคเรซิ่น ใช้งานได้ทั้งภายในและภายนอกอาคาร มีการยึดเกาะที่ดี และทนทานต่อรังสีอุลตร้าไวโอเลตและสภาพอากาศต่าง ๆ",

      usage: [
        "ทาภายในอาคาร",
        "ทาภายนอกอาคาร",
      ],

      coverage: "0.09 – 0.10 กก./ตร.ม. @ 35 – 40 ไมครอน",

      package: [
        "18.9 ลิตร",
      ],
    },

    {
      code: "RTP-E250",

      name: "สีน้ำอะครีลิค สำหรับภายนอก",

      description:
        "RTP-E250 เป็นสีน้ำอะครีลิค ผลิตจากอะครีลิคเรซิ่น สำหรับงานภายนอกอาคาร มีการยึดเกาะที่ดี และทนทานต่อรังสีอุลตร้าไวโอเลตและสภาพอากาศได้ดี",

      usage: [
        "ทาภายนอกอาคาร",
      ],

      coverage: "0.09 – 0.10 กก./ตร.ม. @ 35 – 40 ไมครอน",

      package: [
        "18.9 ลิตร",
      ],
    },

    {
      code: "RTP-E251",

      name: "สีน้ำอะครีลิค สำหรับภายใน",

      description:
        "RTP-E251 เป็นสีน้ำอะครีลิค ผลิตจากอะครีลิคเรซิ่น สำหรับงานภายในอาคาร มีสมบัติการยึดเกาะที่ดี",

      usage: [
        "ทาภายในอาคาร",
      ],

      coverage: "0.10 – 0.12 กก./ตร.ม. @ 35 – 40 ไมครอน",

      package: [
        "18.9 ลิตร",
      ],
    },
  ],
},
    ],
  },

  {
    id: 4,
    name: "สีกันรั่วซึม",

    items: [
      {
  title: "สีกันรั่วซึมอะครีลิค",

  products: [
    {
      code: "RTP-W100",

      name: "สีกันรั่วซึมอะครีลิคความยืดหยุ่นสูง",

      description:
        "RTP-W100 เป็นสีกันรั่วซึมอะครีลิคสูตรน้ำ เป็นมิตรต่อสิ่งแวดล้อม เหมาะสำหรับงานระบบกันซึมดาดฟ้าและกระเบื้องหลังคา มีการยึดเกาะกับคอนกรีตได้ดี และทนทานต่อรังสีอุลตร้าไวโอเลตและสภาพอากาศต่าง ๆ",

      usage: [
        "ดาดฟ้า",
        "หลังคา",
        "ระเบียง",
        "พื้นที่กันรั่วซึม",
      ],

      coverage: "0.15 – 0.19 กก./ตร.ม. @80 – 100 ไมครอน",

      package: [
        "20 กก.",
      ],
    },
    
  ],
},

     {
  title: "สีกันรั่วซึมโพลียูรีเทน",

  products: [
      {
        code: "RTP-W600",

        name: "สีกันรั่วซึมโพลียูรีเทนความยืดหยุ่นสูง",

        description:
          "RTP-W600 เป็นสีกันรั่วซึมโพลียูรีเทน 2 ส่วน สูตรน้ำ เป็นมิตรต่อสิ่งแวดล้อม เหมาะสำหรับระบบกันซึมที่ต้องการฟิล์มบาง มีความยืดหยุ่นสูง แข็งแรง และทนทานต่อสภาพอากาศต่าง ๆ",

        usage: [
          "ดาดฟ้า",
          "หลังคา",
          "ระเบียง",
          "พื้นที่กันรั่วซึม",
        ],

        coverage: "0.2 – 0.4 กก./ตร.ม. @ กลิ้ง 1 รอบ",

        package: [
          "20 กก./ชุด (ส่วน A = 19.5 กก. / ส่วน B = 0.5 กก.)",
        ],
      },
      {
        code: "RTP-W601",

        name: "สีกันรั่วซึมโพลียูรีเทนความยืดหยุ่นสูง",

        description:
          "RTP-W601 เป็นสีกันซึมโพลียูรีเทน สูตรนํ ้า ใช้งานง่าย ผลิตจากโพลียูรีเทนชนิดที่มีความยืดหยุ่น ปราศจากตัวทําละลาย ใช้ติดตั้งในระบบกันซึมดาดฟ้า ผนังอาคาร ระเบียง และ รางระบายนํ้า สามารถยึดเกาะได้ดีกับหลายพื้นผิว มีความทนแรงดึง และความยึดเกาะได้ดี ",

        usage: [
          "ดาดฟ้า",
          "หลังคา",
          "ระเบียง",
          "พื้นที่กันรั่วซึม",
        ],

        coverage: "0.2 – 0.4 กก./ตร.ม. @ กลิ้ง 1 รอบ",

        package: [
          "20 กก./ชุด (ส่วน A = 19.5 กก. / ส่วน B = 0.5 กก.)",
        ],
      },
       {
      code: "RTP-W503",

      name: "สีโพลียูเรีย-ยูรีเทน ",

      description:
        "RTP-W503  เป็นยางกันรั่วซึมโพลียูเรีย-ยูรีเทน 2 ส่วน มีความแข็งมากกว่า 50 shore A และค่าการยืดตัวที่สูงกว่า 500 % นอกจากนี้ มีสมบัติทางไดนามิคและเชิงกลที่ดีเยี่ยมและทนทานต่อสภาวะแวดล้อมได้ดี เหมาะสำหรับนำไปใช้เป็นพื้นดาดฟ้า  ",

      usage: [
        "ดาดฟ้า",
        "หลังคา",
        "ระเบียง",
        "พื้นที่กันรั่วซึม",
      ],

      coverage: "0.15 – 0.19 กก./ตร.ม. @80 – 100 ไมครอน",     

      package: [
        "20 กก./ชุด (ส่วน A = 10 กก. , ส่วน B = 10 กก.)"  
      ],
    },  
  ],
},
    ],
  },
  {
    id: 5,
    name: "สีสนามกีฬา",

    items: [
      {
  title: "สีโพลียูเรีย-ยูรีเทน",

  products: [
    {
      code: "RTP-W503",

      name: "สีโพลียูเรีย-ยูรีเทน ",

      description:
        "RTP-W503  เป็นยางกันรั่วซึมโพลียูเรีย-ยูรีเทน 2 ส่วน มีความแข็งมากกว่า 50 shore A และค่าการยืดตัวที่สูงกว่า 500 % นอกจากนี้ มีสมบัติทางไดนามิคและเชิงกลที่ดีเยี่ยมและทนทานต่อสภาวะแวดล้อมได้ดี เหมาะสำหรับนำไปใช้เป็นพื้นดาดฟ้า  ",

      usage: [
        "ดาดฟ้า",
        "หลังคา",
        "ระเบียง",
        "พื้นที่กันรั่วซึม",
      ],

      coverage: "0.15 – 0.19 กก./ตร.ม. @80 – 100 ไมครอน",     

      package: [
        "20 กก./ชุด (ส่วน A = 10 กก. , ส่วน B = 10 กก.)"  
      ],
    },
     {
      code: "RTP-R900",

      name: "สีกันรั่วซึมโพลียูรีเทนความยืดหยุ่นสูง",

      description:
        "RTP-R900 เป็นสีเคลือบโพลียูรีเทนยืดหยุ่น ประกอบด้วย 2 ส่วน คือ โพลีอีเทอร์-โพลีออล์ล และอะลิฟาติกไอโซไซยาเนต ซึ่งมีสมบัติหยืดหยุ่นได้ ทนต่อรังสี UV และสภาวะอากาศได้",

      usage: [
        "ดาดฟ้า",
        "หลังคา",
        "ระเบียง",
        "พื้นที่กันรั่วซึม",
      ],

      coverage: "0.2 – 0.4 กก./ตร.ม. @ กลิ้ง 1 รอบ",

      package: [
        "6 กก./ชุด (ส่วน A = 5 กก., ส่วน B = 1 กก.) ",
        "18 กก./ชุด (ส่วน A = 15 กก., ส่วน B = 3 กก.)",
      ],
    },
  ],
},
    ],
  },

  {
    id: 6,
    name: "สีเฉพาะทาง",

    items: [
      {
  title: "สีสะท้อนความร้อน",

  products: [
    {
      code: "RTP-W201",

      name: "สีสะท้อนความร้อน",

      description:
        "RTP-W201 เป็นสีน้ำกันรั่วซึมอะครีลิคชนิดสะท้อนความร้อน ช่วยลดความร้อนที่ถ่ายเทเข้าสู่บ้านหรืออาคาร ทำให้อุณหภูมิภายในลดลง พร้อมทั้งมีคุณสมบัติกันรั่วซึมน้ำ และทนทานต่อสภาพอากาศได้ดี",

      usage: [
        "ผนังอาคาร",
        "ดาดฟ้า",
        "หลังคา",
      ],

      coverage: "0.255 กก./ตร.ม. @150 ไมครอน",

      package: [
        "17 กก.",
      ],
    },
  ],
},

      {
  title: "โคลทาร์",

  products: [
    {
      code: "RTP-R600",

      name: "อีพ็อกซีโคลทาร์",

      description:
        "RTP-R600 เป็นสีโคลทาร์อีพ็อกซี่ 2 ส่วน มีส่วนผสมของยางมะตอย มีเนื้อฟิล์มสูง เหมาะสำหรับงานภายใน ให้การปกป้องพื้นผิวเหล็กและคอนกรีตได้ดี",

      usage: [
        "แท้งค์ภายใน",
        "พื้นผิวเหล็ก",
        "พื้นผิวคอนกรีต",
      ],

      coverage: "0.18 – 0.55 กก./ตร.ม @75 – 115 ไมครอน",

      package: [
        "24 กก./ชุด (ส่วน A = 18 กก. / ส่วน B = 6 กก.)",
        "4 กก./ชุด (ส่วน A = 3 กก. / ส่วน B = 1 กก.)",
      ],
    },
  ],
},

     {
  title: "กาวอีพ็อกซี่",

  products: [
    {
      code: "RTP-I100",

      name: "กาวอีพ็อกซี่สำหรับงานอัดประสานรอยแตกร้าว",

      description:
        "RTP-I100 เป็นกาวอีพ็อกซี่ 2 ส่วน ชนิดไม่มีตัวทำละลาย มีความหนืดต่ำ เหมาะสำหรับงานอัดฉีด (Injection) เพื่อประสานรอยแตกร้าวลึก มีการยึดเกาะดีเยี่ยม และไม่หดตัว",

      usage: [
        "งานอัดฉีดรอยแตกร้าว",
        "งานประสานคอนกรีต",
        "ซ่อมแซมโครงสร้าง",
      ],

      coverage: "0.18 – 0.55 กก./ตร.ม @75 – 115 ไมครอน",

      package: [
        "27 กก./ชุด (ส่วน A = 18 กก. / ส่วน B = 9 กก.)",
      ],
    },
  ],
},

    ],
  },
];

export default function Products() {
const [active, setActive] = useState(1);
const [selectedItem, setSelectedItem] = useState(null);
const [activeColor, setActiveColor] = useState(null);
  const detailRef = useRef(null);
const [search, setSearch] = useState("");
  const current = categories.find((c) => c.id === active);
  const allProducts = categories.flatMap((category) =>
  category.items.flatMap((item) =>
    item.products.map((product) => ({
      ...product,
      categoryName: category.name,
      itemTitle: item.title,
    }))
  )
);
const productsToShow = search
  ? allProducts.filter((product) =>
      [
        product.code,
        product.name,
        product.description,
        ...(product.usage || []),
      ]
        .join(" ")
        .toLowerCase()
        .includes(search.toLowerCase())
    )
  : selectedItem?.products || [];
  const pusColors = [
  ["PUS-Black-01", "#0F0F0F", "#2E2E2E"],
  ["PUS-Grey-01", "#DDD3B3", "#E7DFC4"],
  ["PUS-Grey-02", "#D4D4CF", "#DDDDD8"],
  ["PUS-Grey-03", "#C8C8C4", "#D2D2CE"],
  ["PUS-Grey-04", "#A8A5A4", "#B6B3B2"],
  ["PUS-Grey-05", "#D9D5C8", "#E6E1D3"],
  ["PUS-Grey-06", "#8D9091", "#A1A4A5"],
  ["PUS-Green-01", "#8DA770", "#A8C18B"],
  ["PUS-Green-02", "#55763A", "#6B8E4A"],
  ["PUS-Green-03", "#7ADBCF", "#9DE9DE"],
  ["PUS-Green-04", "#4EA996", "#63B8A7"],
  ["PUS-Blue-01", "#2D78B7", "#4A95D2"],

  ["PUS-Blue-02", "#3394C1", "#5FAFD8"],
  ["PUS-Blue-03", "#1376B9", "#3D93D2"],
  ["PUS-Blue-04", "#224EA7", "#3A67C6"],

  ["PUS-Cream-01", "#F1E3B4", "#F5EBC8"],
  ["PUS-Cream-02", "#F0D898", "#F5E7B8"],

  ["PUS-Yellow-01", "#F09A07", "#FFC31A"],
  ["PUS-Yellow-06", "#E18214", "#F0A12B"],

  ["PUS-Red-01", "#6B3428", "#8A4638"],
  ["PUS-Red-02", "#E0829C", "#F2A6BC"],
  ["PUS-Red-03", "#D6323D", "#F04A59"],
  ["PUS-Red-04", "#B62D24", "#D94842"],
];
  return (
    <div className="min-h-screen bg-black text-white px-6 py-16">

      {/* TITLE */}
    <h1 className="text-5xl font-black text-center text-orange-500 mb-12">
  สินค้าของเรา
</h1>

<div className="max-w-2xl mx-auto mb-10">
  <input
    type="text"
    placeholder="🔍 ค้นหาชื่อสินค้า หรือรหัสสินค้า..."
    value={search}
    onChange={(e) => setSearch(e.target.value)}
    className="w-full px-5 py-4 rounded-2xl bg-[#111] border border-orange-500/20 text-white"
  />
</div>
      {/* CATEGORY BUTTONS */}
      <div className="flex flex-wrap justify-center gap-3 mb-12">
        {categories.map((cat) => (
          <button
            key={cat.id}
            onClick={() => {
              setActive(cat.id);
              setSelectedItem(null);
            }}
            className={`
              px-5 py-3 rounded-2xl border transition-all duration-300
              ${
                active === cat.id
                  ? "bg-orange-500 text-black font-bold shadow-[0_0_20px_rgba(255,115,0,0.4)]"
                  : "border-orange-500/30 hover:border-orange-500 hover:shadow-[0_0_15px_rgba(255,115,0,0.25)]"
              }
            `}
          >
            {cat.name}
          </button>
        ))}
      </div>

      {/* CONTENT */}
      <div className="max-w-5xl mx-auto bg-[#111] p-8 rounded-3xl border border-orange-500/20">

        <h2 className="text-2xl font-bold mb-6 text-orange-400">
          {current?.name}
        </h2>

        <div className="grid md:grid-cols-2 gap-4">
         {current?.items.map((item, i) => (
 <div
  key={i}
  onClick={() => {
  setSelectedItem(item);

  setTimeout(() => {
    detailRef.current?.scrollIntoView({
      behavior: "smooth",
      block: "start",
    });
  }, 100);
}}
  className={`
    bg-black/40 p-4 rounded-xl border transition-all duration-300
    hover:border-orange-500 hover:translate-x-1 cursor-pointer
    ${
      selectedItem?.title === item.title
        ? "border-orange-500"
        : "border-orange-500/10"
    }
  `}
>
  
<p className="text-white font-semibold">
  {item.title}
</p>

    <p className="text-neutral-500 text-sm mt-2">
      {item.products.length} Products
    </p>

  </div>
))}
        </div>

        </div>
        
{/* RAL COLOR CATALOG */}
<div className="max-w-6xl mx-auto my-12">

  <div className="bg-[#111] rounded-3xl border border-orange-500/20 overflow-hidden">

    <div className="p-6 border-b border-orange-500/10">

      <h2 className="text-3xl font-bold text-orange-500">
        เฉดสีมาตรฐาน RAL
      </h2>

      <p className="text-neutral-400 mt-2">
        รองรับการผลิตและผสมสีตามมาตรฐาน RAL สำหรับงานอุตสาหกรรม
      </p>

    </div>

   <div className="grid grid-cols-3 md:grid-cols-5 lg:grid-cols-8 gap-3">

{selectedItem?.colorChart?.map(([ral, name, hex], index) => (
  <div
    key={index}
    onClick={() =>  setActiveColor(activeColor === index ? null : index)}
    className="
      group
      relative
      cursor-pointer
      transition-all
      duration-300
      hover:scale-110
      hover:z-20
    "
  >
    {/* สี */}
    <div
      className="
        h-16
        rounded-lg
        border
        border-white/10
        shadow-lg
      "
     style={{
  backgroundColor: hex,
}}
    />

    {/* รหัสสี */}
    <p className="text-[10px] text-center text-gray-300 mt-1">
      {ral}
    </p>

    {/* Hover */}
   <div
  className={`
    absolute
    bottom-full
    left-1/2
    -translate-x-1/2
    mb-2
    z-50
    bg-black
    border
    border-orange-500/30
    rounded-lg
    px-3
    py-2
    whitespace-nowrap
    shadow-xl
    transition-all
    duration-300
    ${
      activeColor === index
        ? "opacity-100"
        : "opacity-0 pointer-events-none"
    }
  `}
>
    
      <p className="text-orange-400 font-bold text-xs">
        {ral}
      </p>

      <p className="text-white text-xs">
        {name}
      </p>
    </div>
  </div>
))}
</div>

  </div>


</div>
{selectedItem?.showESD && (
  <div className="max-w-6xl mx-auto mb-12 bg-[#111] rounded-3xl border border-orange-500/20 p-6">

    <h3 className="text-center text-orange-500 font-bold text-xl mb-6">
      POLYURETHANE ELECTROSTATIC DISSIPATIVE
    </h3>

    <div className="grid grid-cols-2 md:grid-cols-5 gap-3">
      <div>
        <div className="h-14 rounded-lg bg-[#462F27]" />
        <p className="text-center text-xs mt-2">PUESD-Red</p>
      </div>

      <div>
        <div className="h-14 rounded-lg bg-[#646665]" />
        <p className="text-center text-xs mt-2">PUESD-Grey</p>
      </div>

      <div>
        <div className="h-14 rounded-lg bg-[#484941]" />
        <p className="text-center text-xs mt-2">PUESD-Dark Grey</p>
      </div>

      <div>
        <div className="h-14 rounded-lg bg-[#393F2D]" />
        <p className="text-center text-xs mt-2">PUESD-Green</p>
      </div>

      <div>
        <div className="h-14 rounded-lg bg-[#48544A]" />
        <p className="text-center text-xs mt-2">PUESD-Dark Green</p>
      </div>
    </div>

  </div>
)}
{selectedItem?.showPUS && (
  <div className="max-w-6xl mx-auto mb-12 bg-[#111] rounded-3xl border border-orange-500/20 p-6">

    <h3 className="text-center text-orange-500 font-bold text-xl mb-6">
      POLYURETHANE SCREED
    </h3>

    <div className="grid grid-cols-2 md:grid-cols-4 gap-4">

      {pusColors.map(([code, left, right], index) => (
        <div key={index}>
          <div
            className="h-14 rounded-lg border border-white/10"
            style={{
              background: `linear-gradient(to right, ${left} 50%, ${right} 50%)`,
            }}
          />

          <p className="text-center text-xs mt-2">
            {code}
          </p>
        </div>
      ))}

    </div>

  </div>
)}

{/* PRODUCTS */}
{(search || selectedItem?.products?.length > 0) && (
  <div
    ref={detailRef}
    className="mt-10"
  >
    <h3 className="text-2xl font-bold text-orange-400 mb-6">
      รายการสินค้า
    </h3>

    <div className="grid md:grid-cols-2 gap-5">

{productsToShow.map((product, i) => (

    <div
      key={i}
      className="
        bg-[#111]
        rounded-3xl
        overflow-hidden
        border border-orange-500/10
        hover:border-orange-500/40
        transition-all duration-300
        hover:-translate-y-1
      "
    >
          {/* IMAGE */}
         <div className="h-[380px] bg-black flex items-center justify-center p-4 border-b border-orange-500/10">

            <div className="w-full h-full rounded-2xl bg-neutral-900 shadow-2xl transition-all duration-500">

              {/* ถังสินค้า */}
              <div className="w-full h-full flex items-center justify-center">

            {product.images && (
 <Swiper
  modules={[Navigation, Pagination]}
  navigation
  pagination={{ clickable: true }}
  loop
  className="w-full h-[340px]"
>
    {product.images.map((image, index) => (
      <SwiperSlide key={index}>
       <img
  src={image}
  alt={`${product.code}-${index}`}
  className="w-full h-[340px] object-cover rounded-xl"
/>
      </SwiperSlide>
    ))}
  </Swiper>
)}
              </div>

            </div>

          </div>

          {/* CONTENT */}
          <div className="p-5">

            <div className="flex items-center justify-between gap-3 mb-3">

              <p className="text-orange-500 font-black text-lg">
                {product.code}
              </p>

            </div>

            <p className="text-white font-bold text-lg leading-7 mb-4">
              {product.name}
            </p>

            <p className="text-neutral-400 text-sm leading-7 mb-5">
              {product.description}
            </p>

            {/* การใช้งาน */}
            <div className="mb-5">

              <p className="text-orange-400 font-bold mb-2">
                การนำไปใช้
              </p>
{/* COLOR OPTIONS */}
<div className="mb-5">

  <div className="flex flex-wrap gap-2">

    {product.colors?.map((color, index) => (
      <div
        key={index}
        className="flex items-center gap-2 bg-black/40 px-3 py-2 rounded-lg border border-white/10"
      >
        <div
          className="w-5 h-5 rounded-full border border-white/20"
          style={{
            backgroundColor: color.hex,
          }}
        />

        <span className="text-xs text-gray-300">
          {color.code}
        </span>
      </div>
    ))}

  </div>

</div>
              <div className="flex flex-wrap gap-2">

                {product.usage?.map((u, index) => (
                  <span
                    key={index}
                    className="
                      px-3 py-1 rounded-full
                      bg-orange-500/10
                      border border-orange-500/20
                      text-orange-300
                      text-xs
                    "
                  >
                    {u}
                  </span>
                ))}

              </div>

            </div>

            {/* Coverage */}
            <div className="mb-5">

              <p className="text-orange-400 font-bold mb-2">
                ปริมาณการใช้
              </p>

              <p className="text-neutral-300 text-sm">
                {product.coverage}
              </p>

            </div>

            {/* Package */}
            <div>

              <p className="text-orange-400 font-bold mb-2">
                ขนาดบรรจุ
              </p>

              <ul className="space-y-2">

                {product.package?.map((p, index) => (
                  <li
                    key={index}
                    className="
                      text-sm text-neutral-300
                      bg-black/40
                      border border-white/5
                      rounded-xl
                      px-3 py-2
                    "
                  >
                    {p}
                  </li>
                ))}

              </ul>

            </div>

          </div>

        </div>

      ))}

    </div>

  </div>
)}
    </div>
  );
}